Управление_торговлей_демо/src/InformationRegisters/ПакетыКодовМаркировкиИСМП/ПакетыКодовМаркировкиИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПакетыКодовМаркировкиИСМП</name>
  <resources>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СписаниеКодовМаркировкиИСМП</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сообщение</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_демо/src/InformationRegisters/ПакетыКодовМаркировкиИСМП/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Осуществляет запись в регистр по переданным данным.
//
// Параметры:
//  ДанныеЗаписи - Структура - данные для записи в регистр
//
Процедура ВыполнитьЗаписьВРегистр(ДанныеЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ПакетыКодовМаркировкиИСМП.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаписи);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Удаляет запись из регистра по переданному документу.
//
// Параметры:
//  ДокументОснование  - ДокументСсылка.МаркировкаТоваровИСМП - измерение регистра для очистки.
//
Процедура УдалитьЗаписиПоДокументу(ДокументОснование) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ПакетыКодовМаркировкиИСМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОснование.Установить(ДокументОснование);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьДанныеПоДокументу(ДокументОснование) Экспорт
	
	КодыМаркировки = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПакетыКодовМаркировкиИСМП.ДокументОснование КАК ДокументОснование,
	|	МАКСИМУМ(ПакетыКодовМаркировкиИСМП.Версия) КАК Версия
	|ПОМЕСТИТЬ ВерсииСообщений
	|ИЗ
	|	РегистрСведений.ПакетыКодовМаркировкиИСМП КАК ПакетыКодовМаркировкиИСМП
	|ГДЕ
	|	ПакетыКодовМаркировкиИСМП.ДокументОснование = &ДокументОснование
	|	И ПакетыКодовМаркировкиИСМП.Сообщение <> &ПустоеСообщение
	|СГРУППИРОВАТЬ ПО
	|	ПакетыКодовМаркировкиИСМП.ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование,
	|	Версия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПакетыКодовМаркировкиИСМП.ДокументОснование КАК ДокументОснование,
	|	ПакетыКодовМаркировкиИСМП.ДанныеСообщения КАК ДанныеСообщения
	|ИЗ
	|	ВерсииСообщений КАК ВерсииСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыКодовМаркировкиИСМП КАК ПакетыКодовМаркировкиИСМП
	|		ПО ПакетыКодовМаркировкиИСМП.ДокументОснование = ВерсииСообщений.ДокументОснование
	|		И ПакетыКодовМаркировкиИСМП.Версия = ВерсииСообщений.Версия";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ПустоеСообщение", ИнтеграцияИСМПСлужебный.СтроковоеПредставлениеПустогоУникальногоИдентификатора());
	
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаРезультата Из Результат Цикл
		Если ТипЗнч(СтрокаРезультата.ДанныеСообщения) <> Тип("ХранилищеЗначения") Тогда
			Продолжить;
		КонецЕсли;
		ДанныеСообщения = СтрокаРезультата.ДанныеСообщения.Получить();
		Если ТипЗнч(ДанныеСообщения) <> Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КодыМаркировки, ДанныеСообщения);
	КонецЦикла;
	
	Возврат КодыМаркировки;
	
КонецФункции

Функция ПолучитьКодыКПовторнойПередаче(ДокументОснование) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = новый Запрос(
	"ВЫБРАТЬ
	|	ПакетыКодовМаркировкиИСМП.ДанныеСообщения КАК ДанныеСообщения
	|ИЗ
	|	РегистрСведений.ПакетыКодовМаркировкиИСМП КАК ПакетыКодовМаркировкиИСМП
	|ГДЕ
	|	ПакетыКодовМаркировкиИСМП.ДокументОснование = &ДокументОснование
	|	И ПакетыКодовМаркировкиИСМП.Сообщение = &ПустоеСообщение");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ПустоеСообщение", ИнтеграцияИСМПСлужебный.СтроковоеПредставлениеПустогоУникальногоИдентификатора());
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ШтрихкодыУпаковок = Новый Соответствие;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.ДанныеСообщения) <> Тип("ХранилищеЗначения") Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСообщения = Выборка.ДанныеСообщения.Получить();
		Если ТипЗнч(ДанныеСообщения) <> Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЭлементДанных Из ДанныеСообщения Цикл
			ШтрихкодыУпаковок.Вставить(ЭлементДанных, Истина);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ШтрихкодыУпаковок;
	
КонецФункции

#КонецОбласти

#КонецЕсли
